source/_posts/2012-04-16-on-semicolons-and-subjective-discussions-revisited.org
#+STARTUP: showall hidestars indent
#+BEGIN_HTML
---
layout: post
title:  On semicolons, pseudo-technical and subjective arguments, revisited
snip:   Yo dawg, I herd you like bikeshedding...
---
#+END_HTML


The JavaScript community is, indeed, very mature — just like any other
programming community. We always find time to properly and politely (and
heatedly!) discuss the most important kinds of topics: like whether to
use [[https://github.com/twitter/bootstrap/issues/3057][semicolons or not]], or whether to use [[http://www.emacswiki.org/emacs/SmartTabs][tabs or spaces]]. Or yet, whether
to use [[http://en.wikipedia.org/wiki/Editor_war][Emacs or Vi{,m}]]. Of course, everyone knows you should use [[http://www.gnu.org/software/emacs/][Emacs]],
so I don't even know why those discussions surface.

In any case, I decided to write a post to shed some light on the subject
+and let the flames begin+. I tried to just shake this whole discussion
away, because it started out too subjective... but I can't. This is an
important post. [[http://xkcd.com/386/][Someone is *wrong* on the internet!]]


* A bit of history

Discussions on the rules of /Automatic Semicolon Insertion/ (henceforth /ASI/)
aren't a new thing in the community. In fact, we've been seeing these for as
long as the community exists — well, perhaps not as much, but definitely the
discussions did grow as the community as a whole grew.

On the one side, there are people who argue that /ASI/ is harmful, and you
should be ashamed of using such a excuse for "poor coding style". Of course,
the qualities of a coding style are, usually, extremely subjective, and make
absolute no sense taken without context — that is, without stating what
concerns the particular coding style chosen tries to address. Other arguments
involve blatant (and sometimes personal) attacks on people who don't use
semicolons in their code, misconceptions about when /ASI/ applies, and things
like "we've told ASI is harmful, so it must be!" or "JS is not a semicolon-less
language" — I wonder if they would also consider Python and Haskell as
non-semicolon-less languages, since they also have semicolons and ASI (albeit
much more significant line breaks and white space handling).

On the other side, there are people who argue that semicolons are harmful, and
we're much better off without them. Arguments against semicolons vary from a
simple "Yes, yes we can!", passing through the "But I use other languages that
don't require semicolons!", to the "Omitting semicolons make errors more
apparent by transforming them in non-usual things" — needless to say those are
not the actual quotes, but they are close enough to the crux of the arguments.

In this post, despite the hints for flamewar here and there, I'll try to lay
out the discussion from a not-so-biased standpoint. I am on the /Yay ASI!/,
side, though, so you might see some bias here and there — I'll try to make
those as overt as possible, so you can just laugh it off (or rage) and move
on.


