source/_posts/2012-04-16-on-semicolons-and-subjective-discussions-revisited.org
* What is /ASI/?

We can't start this whole discussion without first clarifying what we're
talking about. That's why, we first need to define what in the Lord's name
/ASI/ is.

Let's start with the [[http://es5.github.com/#x7.9][specification]] definition of this whole mess:

#+BEGIN_QUOTE
  Certain ECMAScript statements (empty statement, variable statement,
  expression statement, =do-while= statement, =continue= statement, =break=
  statement, =return= statement, and =throw= statement) must be terminated with
  semicolons. Such semicolons may always appear explicitly in the source
  text. For convenience, however, such semicolons may be omitted from the
  source text in certain situations. These situations are described by saying
  that semicolons are automatically inserted into the source code token stream
  in those situations.
#+END_QUOTE

The specification then goes on to define all of the rules by which semicolon
insertion takes place.

If you still don't grasp what /ASI/ is after reading this part of the
specification, don't worry, most people don't. We could summarise it as: "You
need semicolons to end the statements cited above, but for convenience you can
omit them in some situations, if you want to."

As [[http://brendaneich.com/2012/04/the-infernal-semicolon/][Brendan Eich]] noted in his post, /ASI/ is an syntactic error-correction
procedure, that got implemented in JavaScript engine parsers and then made it
into the specification. This means that, technically speaking, all code written
without semicolons has syntactic errors in them. There's no denying it, because
that's how the specification describes these procedures.

Practically speaking, though, the parsing rules and /ASI/ rules — should we
even call it that, since parsers don't need to actually add that token, — for
the ECMAScript language are pretty deterministic, and ambiguities in terms of
/Automatic Semicolon Insertion/ can be resolved in a single or double look-ahead
— if we ignore comments and horizontal white space.

In fact, if we looked at the practical matter of the subject, we could
categorise famous languages' semicolon insertion rules in the following groups:

  - White-space strict (aka Statements ends as early as possible) ::
    With [[http://www.python.org/][Python]] as the most known example of this particular style. In a
    language where "statements ends as early as possible", you can kind of
    define the language's statements' (or expressions) rules as the following:

    #+BEGIN_SRC bnf
      <statement>        ::= ( lots of junk ) <end-of-statement>
      <end-of-statement> ::= NEWLINE | ";"
    #+END_SRC

    Which, at a first glance, might look quite easy to remember, right?
    Unfortunately, in real world code, there are quite some more intricacies
    regarding these rules. Sticking with Python, since you want a little more
    expressiveness on how to lay out your long statements, Python offers you
    optional implicit and explicit statement continuations. So, a simple
    example with a string spanning multiple lines (and yes, I am aware of the
    additional constructs for multi-line strings in the language), would look
    like the following:

    #+BEGIN_SRC bnf
      foo = "a string"    \
          + "in multiple" \
          + "lines."
    #+END_SRC

    Notice how each line has to be terminated with an explicit
    continuation. Worse! If your editor can't highlight invisible characters,
    you risk running into the following error:

    #+BEGIN_SRC shell-script
      $ python test.py
        File "test.py", line 1
           foo = "a line" \
                            ^
      SyntaxError: unexpected character after line continuation character.
    #+END_SRC
    
    An alternative to explicit continuations are implicit line joins, which
    happen on parenthesised expressions:

    #+BEGIN_SRC bnf
      foo = ( "a string"
              "in multiple"
              "lines." )
    #+END_SRC
    
    Note that, in Python's particular case, the concatenation operator isn't
    necessary when two chunks of strings are separated by just
    white-space. This style saves you from worrying about whether there's
    white-space after your explicit continuations, but then your simple
    =<end-of-statement>= rules stop being just =NEWLINE | “;”=.


  - Non-white-space strict (aka If we can't parse, insert a damn semicolon!) ::
    ECMAScript is actually the only language I know who fits this bill —
    Haskell having even more complex statement rules, but managing to be
    overtly white-space strict.

    In ECMAScript, your statements *always* ends up with a semicolon. Whether
    you need to explicitly spell one in your source code, though, is another
    matter entirely. In fact, you can write large JavaScript applications
    without needing to write any semicolon in your source code at all,
    (comments excluded), as long as you stay away from old-style =for= loops.

    In JavaScript, the same example above would look like this:

    #+BEGIN_SRC bnf
      var foo = "a string"
              + "in multiple"
              + "lines."
    #+END_SRC

    ECMAScript's handling of statement continuation, imho, feels much more
    natural to read and write than Python's one. Therefore, they are, of
    course, *TEH BESTEST* — if my feelings would constitute actual arguments,
    sadly they do not.


