_posts/2012-04-16-on-semicolons-and-subjective-discussions-revisited.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">What is <i>ASI</i>?</h2>
<div class="outline-text-2" id="text-2">


<p>
We can't start this whole discussion without first clarifying what we're
talking about. That's why, we first need to define what in the Lord's name
<i>ASI</i> is.
</p>
<p>
Let's start with the <a href="http://es5.github.com/#x7.9">specification</a> definition of this whole mess:
</p>
<blockquote>

<p>Certain ECMAScript statements (empty statement, variable statement,
expression statement, <code>do-while</code> statement, <code>continue</code> statement, <code>break</code>
statement, <code>return</code> statement, and <code>throw</code> statement) must be terminated with
semicolons. Such semicolons may always appear explicitly in the source
text. For convenience, however, such semicolons may be omitted from the
source text in certain situations. These situations are described by saying
that semicolons are automatically inserted into the source code token stream
in those situations.
</p>
</blockquote>


<p>
The specification then goes on to define all of the rules by which semicolon
insertion takes place.
</p>
<p>
If you still don't grasp what <i>ASI</i> is after reading this part of the
specification, don't worry, most people don't. We could summarise it as: "You
need semicolons to end the statements cited above, but for convenience you can
omit them in some situations, if you want to."
</p>
<p>
As <a href="http://brendaneich.com/2012/04/the-infernal-semicolon/">Brendan Eich</a> noted in his post, <i>ASI</i> is an syntactic error-correction
procedure, that got implemented in JavaScript engine parsers and then made it
into the specification. This means that, technically speaking, all code written
without semicolons has syntactic errors in them. There's no denying it, because
that's how the specification describes these procedures.
</p>
<p>
Practically speaking, though, the parsing rules and <i>ASI</i> rules — should we
even call it that, since parsers don't need to actually add that token, — for
the ECMAScript language are pretty deterministic, and ambiguities in terms of
<i>Automatic Semicolon Insertion</i> can be resolved in a single or double look-ahead
— if we ignore comments and horizontal white space.
</p>
<p>
In fact, if we looked at the practical matter of the subject, we could
categorise famous languages' semicolon insertion rules in the following groups:
</p>
<dl>
<dt>White-space strict (aka Statements ends as early as possible)</dt><dd>
<p>
    With <a href="http://www.python.org/">Python</a> as the most known example of this particular style. In a
    language where "statements ends as early as possible", you can kind of
    define the language's statements' (or expressions) rules as the following:
</p>



<pre class="src src-bnf">&lt;statement&gt;        ::= ( lots of junk ) &lt;end-of-statement&gt;
&lt;end-of-statement&gt; ::= NEWLINE | <span style="color: #A6E32D;">";"</span>
</pre>


<p>
    Which, at a first glance, might look quite easy to remember, right?
    Unfortunately, in real world code, there are quite some more intricacies
    regarding these rules. Sticking with Python, since you want a little more
    expressiveness on how to lay out your long statements, Python offers you
    optional implicit and explicit statement continuations. So, a simple
    example with a string spanning multiple lines (and yes, I am aware of the
    additional constructs for multi-line strings in the language), would look
    like the following:
</p>



<pre class="src src-bnf">foo = <span style="color: #A6E32D;">"a string"</span>    \
    + <span style="color: #A6E32D;">"in multiple"</span> \
    + <span style="color: #A6E32D;">"lines."</span>
</pre>


<p>
    Notice how each line has to be terminated with an explicit
    continuation. Worse! If your editor can't highlight invisible characters,
    you risk running into the following error:
</p>



<pre class="src src-shell-script">$ python test.py
  File <span style="color: #A6E32D;">"test.py"</span>, line 1
     foo = <span style="color: #A6E32D;">"a line"</span> <span style="color: #A6E32D;">\</span>
                      ^
SyntaxError: unexpected character after line continuation character.
</pre>


<p>    
    An alternative to explicit continuations are implicit line joins, which
    happen on parenthesised expressions:
</p>



<pre class="src src-bnf">foo = ( <span style="color: #A6E32D;">"a string"</span>
        <span style="color: #A6E32D;">"in multiple"</span>
        <span style="color: #A6E32D;">"lines."</span> )
</pre>


<p>    
    Note that, in Python's particular case, the concatenation operator isn't
    necessary when two chunks of strings are separated by just
    white-space. This style saves you from worrying about whether there's
    white-space after your explicit continuations, but then your simple
    <code>&lt;end-of-statement&gt;</code> rules stop being just <code>NEWLINE | “;”</code>.
</p></dd>
</dl>



<dl>
<dt>Non-white-space strict (aka If we can't parse, insert a damn semicolon!)</dt><dd>
<p>
    ECMAScript is actually the only language I know who fits this bill —
    Haskell having even more complex statement rules, but managing to be
    overtly white-space strict.
</p>
<p>
    In ECMAScript, your statements <b>always</b> ends up with a semicolon. Whether
    you need to explicitly spell one in your source code, though, is another
    matter entirely. In fact, you can write large JavaScript applications
    without needing to write any semicolon in your source code at all,
    (comments excluded), as long as you stay away from old-style <code>for</code> loops.
</p>
<p>
    In JavaScript, the same example above would look like this:
</p>



<pre class="src src-bnf">var foo = <span style="color: #A6E32D;">"a string"</span>
        + <span style="color: #A6E32D;">"in multiple"</span>
        + <span style="color: #A6E32D;">"lines."</span>
</pre>


<p>
    ECMAScript's handling of statement continuation, imho, feels much more
    natural to read and write than Python's one. Therefore, they are, of
    course, <b>TEH BESTEST</b> — if my feelings would constitute actual arguments,
    sadly they do not.
</p></dd>
</dl>



</div>

</div>
