source/_posts/2012-04-16-on-semicolons-and-subjective-discussions-revisited.org
* How /ASI/ actually works?

If you've been reading the comments from this whole +flamewar+ discussion,
you'll see that many people describe /ASI/ in JavaScript as a [[https://github.com/twitter/bootstrap/issues/3057#issuecomment-5138012][*guessing
game*]]. They couldn't be further from the truth. In fact, there's no guessing at
all, everything is extremely deterministic from the grammar of the language
itself.

And what's more, to check if an statement ends, a parser would need to use at
most 2 look-aheads, if we don't consider comments and white-space. So, let's
first define what the usual rule for ending a statement in JavaScript is:

#+BEGIN_SRC bnf
  <end-of-statement> ::= ";"
                       | <horizontal-space>* NEWLINE blank*
                         (and STATEMENT_ENDED? (not <continuation>))
  <horizontal-space> ::= SPACE | TAB | <comment>
  <continuation>     ::= "(" | "[" | <infix-operator>
#+END_SRC

Well, actually, it's not as simple as that. You have a few special cases in the
language to handle prefix operators and a few others, like the =return=
statement, which the specification calls =restricted productions=.

For prefix statements, it just suffices to say that they *require* an argument
succeeding then, and so can't end earlier due to a line break. Thus, the
following is valid JavaScript:

#+BEGIN_SRC js
  var a = 1
  ~
  a
  // => -2
#+END_SRC

In the case of =restricted productions=, however, we have the "awesome" =<no
line-break here>= restriction in the grammar itself. Which means that, while
these productions *may* have something succeeding the token, they *do not*
require that such a case happens, and as such, a line break would indicate that
we want to end the statement early. A good example of =restricted productions=,
and that is widely (and mistakenly[fn:1]) used to indicate how you should
always end your statements with a semicolon, is the =return= statement, which
accepts an *optional* return value:

#+BEGIN_SRC bnf
  <return-stmt> ::= "return" [no line break here] <expression>
#+END_SRC

#+BEGIN_SRC js
  (function(){ return 1 })()
  // => 1

  ;(function(){ return
                2 }()
  // => undefined
#+END_SRC

Of course, inserting a semicolon after =2= in the second example won't prevent
the =return= statement from always returning =undefined=.

For more in-depth articles on the intricacies of /ASI/ in JavaScript, please
refer to the awesome people that have written about it [[http://inimino.org/~inimino/blog/javascript_semicolons][over]] and [[http://blog.izs.me/post/2353458699/an-open-letter-to-javascript-leaders-regarding][over]] and over
again. They'll probably dive into more practical (and non-grammar-ish) details
than I have here. Inimino's post is particularly awesome.

[fn:1]: Citation needed.


* Is /ASI/ safe?

We've seen that all of the /ASI/ rules are pretty deterministic, and they don't
rely on any kind of [[http://tvtropes.org/pmwiki/pmwiki.php/Main/BlackMagic][Black Magic]] from hell that only parsers and parser-writers
know. They are also pretty manageable for a human brain to keep on his head
while reading the code — or at least, I consider JavaScript's ASI rules,
despite all of the complexity, in the same level of cognitive overhead as
Python's, if only because it *feels* more natural to me.

But do all of the engines implement it properly? Is it safe? Will my code
suddenly break?!  Well, if you've been [[https://github.com/twitter/bootstrap/issues/3057#issuecomment-5135562][blindly following the Cult of Crockford]],
you might have been lead to believe that the answer to all of those questions
would be: *no*, *NO!*, *BET THE HELL IT WILL*.

Of course, you should apply the =not= predicate from higher-order logic to all
of those answers to get the actual, useful, answers. So, addressing the
concerns in order:

** Do all of the engines implement it properly?
 
Well, as *inimino* says in his post about [[http://inimino.org/~inimino/blog/javascript_semicolons][JavaScript semicolons]], there's no
reason to fear any incompatible behaviour between browsers in regards to the
"feature" (or misfeature, the definitions vary in the community). I have not
been able to verify this claim with empiric proofs yet to date, but from my
experiments in code, it seems to hold perfectly valid.

If any browser implementer would like to clarify the matter, it would be an
interesting (and welcome) addition, indeed.

#+BEGIN_QUOTE
  Another misconception is that bugs in browser JavaScript engines mean that
  using semicolons everywhere is safer, and will protect the developer from
  compatibility issues between browsers. This is simply not the case. All
  extant browsers implement the specification correctly with regard to ASI, and
  any bugs that may have existed are long since lost in the mists of early Web
  history. There is no reason to be concerned about browser compatibility in
  regard to semicolon insertion: all browsers implement the same rules and they
  are the rules given by the spec and explained above.
#+END_QUOTE


** Is it safe?

No. I mean yes. I mean, it depends on what you mean by safe. From a technical
stand-point, it is perfectly safe — after all, it *is* deterministic. You just
need to know the rules.


** Will my code suddenly break?!

As [[http://twitter.com/littlecalculist][David Herman]], a TC39 member, kindly enough clarified [[https://twitter.com/#!/littlecalculist/status/191549755413889024][TC39 won't just break
working code for no good reason]]. All the more when there's such a large body of
working code relying on this particular feature all the way around.

Brendan Eich also discussed the issue with compatibility with older versions of
ECMAScript and legacy code as they move forward to extend the language, several
times (in his blog, in es-discuss, in twitter, in...).

It can all be summed up as: "if something is working and in use in the
JavaScript community, we can't just break it."

So, no, your code will not suddenly break if you start omitting semicolons here
and there. Now, I can't guarantee people won't want to break *you*.


