_posts/2012-04-16-on-semicolons-and-subjective-discussions-revisited.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">How <i>ASI</i> actually works?</h2>
<div class="outline-text-2" id="text-3">


<p>
If you've been reading the comments from this whole <del>flamewar</del> discussion,
you'll see that many people describe <i>ASI</i> in JavaScript as a <a href="https://github.com/twitter/bootstrap/issues/3057#issuecomment-5138012"><b>guessing game</b></a>. They couldn't be further from the truth. In fact, there's no guessing at
all, everything is extremely deterministic from the grammar of the language
itself.
</p>
<p>
And what's more, to check if an statement ends, a parser would need to use at
most 2 look-aheads, if we don't consider comments and white-space. So, let's
first define what the usual rule for ending a statement in JavaScript is:
</p>



<pre class="src src-bnf">&lt;end-of-statement&gt; ::= <span style="color: #A6E32D;">";"</span>
                     | &lt;horizontal-space&gt;* NEWLINE blank*
                       (and STATEMENT_ENDED? (not &lt;continuation&gt;))
&lt;horizontal-space&gt; ::= SPACE | TAB | &lt;comment&gt;
&lt;continuation&gt;     ::= <span style="color: #A6E32D;">"("</span> | <span style="color: #A6E32D;">"["</span> | &lt;infix-operator&gt;
</pre>


<p>
Well, actually, it's not as simple as that. You have a few special cases in the
language to handle prefix operators and a few others, like the <code>return</code>
statement, which the specification calls <code>restricted productions</code>.
</p>
<p>
For prefix statements, it just suffices to say that they <b>require</b> an argument
succeeding then, and so can't end earlier due to a line break. Thus, the
following is valid JavaScript:
</p>



<pre class="src src-js"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">a</span> = 1
~
a
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; -2</span>
</pre>


<p>
In the case of <code>restricted productions</code>, however, we have the "awesome" <code>&lt;no line-break here&gt;</code> restriction in the grammar itself. Which means that, while
these productions <b>may</b> have something succeeding the token, they <b>do not</b>
require that such a case happens, and as such, a line break would indicate that
we want to end the statement early. A good example of <code>restricted productions</code>,
and that is widely (and mistakenly<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>) used to indicate how you should
always end your statements with a semicolon, is the <code>return</code> statement, which
accepts an <b>optional</b> return value:
</p>



<pre class="src src-bnf">&lt;return-stmt&gt; ::= <span style="color: #A6E32D;">"return"</span> [no line break here] &lt;expression&gt;
</pre>



<pre class="src src-js">(<span style="color: #C48DFF;">function</span>(){ <span style="color: #C48DFF;">return</span> 1 })()
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; 1</span>

;(<span style="color: #C48DFF;">function</span>(){ <span style="color: #C48DFF;">return</span>
              2 }()
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; undefined</span>
</pre>


<p>
Of course, inserting a semicolon after <code>2</code> in the second example won't prevent
the <code>return</code> statement from always returning <code>undefined</code>.
</p>
<p>
For more in-depth articles on the intricacies of <i>ASI</i> in JavaScript, please
refer to the awesome people that have written about it <a href="http://inimino.org/~inimino/blog/javascript_semicolons">over</a> and <a href="http://blog.izs.me/post/2353458699/an-open-letter-to-javascript-leaders-regarding">over</a> and over
again. They'll probably dive into more practical (and non-grammar-ish) details
than I have here. Inimino's post is particularly awesome.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Is <i>ASI</i> safe?</h2>
<div class="outline-text-2" id="text-4">


<p>
We've seen that all of the <i>ASI</i> rules are pretty deterministic, and they don't
rely on any kind of <a href="http://tvtropes.org/pmwiki/pmwiki.php/Main/BlackMagic">Black Magic</a> from hell that only parsers and parser-writers
know. They are also pretty manageable for a human brain to keep on his head
while reading the code — or at least, I consider JavaScript's ASI rules,
despite all of the complexity, in the same level of cognitive overhead as
Python's, if only because it <b>feels</b> more natural to me.
</p>
<p>
But do all of the engines implement it properly? Is it safe? Will my code
suddenly break?!  Well, if you've been <a href="https://github.com/twitter/bootstrap/issues/3057#issuecomment-5135562">blindly following the Cult of Crockford</a>,
you might have been lead to believe that the answer to all of those questions
would be: <b>no</b>, <b>NO!</b>, <b>BET THE HELL IT WILL</b>.
</p>
<p>
Of course, you should apply the <code>not</code> predicate from higher-order logic to all
of those answers to get the actual, useful, answers. So, addressing the
concerns in order:
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Do all of the engines implement it properly?</h3>
<div class="outline-text-3" id="text-4-1">


<p> 
Well, as <b>inimino</b> says in his post about <a href="http://inimino.org/~inimino/blog/javascript_semicolons">JavaScript semicolons</a>, there's no
reason to fear any incompatible behaviour between browsers in regards to the
"feature" (or misfeature, the definitions vary in the community). I have not
been able to verify this claim with empiric proofs yet to date, but from my
experiments in code, it seems to hold perfectly valid.
</p>
<p>
If any browser implementer would like to clarify the matter, it would be an
interesting (and welcome) addition, indeed.
</p>
<blockquote>

<p>Another misconception is that bugs in browser JavaScript engines mean that
using semicolons everywhere is safer, and will protect the developer from
compatibility issues between browsers. This is simply not the case. All
extant browsers implement the specification correctly with regard to ASI, and
any bugs that may have existed are long since lost in the mists of early Web
history. There is no reason to be concerned about browser compatibility in
regard to semicolon insertion: all browsers implement the same rules and they
are the rules given by the spec and explained above.
</p>
</blockquote>



</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Is it safe?</h3>
<div class="outline-text-3" id="text-4-2">


<p>
No. I mean yes. I mean, it depends on what you mean by safe. From a technical
stand-point, it is perfectly safe — after all, it <b>is</b> deterministic. You just
need to know the rules.
</p>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Will my code suddenly break?!</h3>
<div class="outline-text-3" id="text-4-3">


<p>
As <a href="http://twitter.com/littlecalculist">David Herman</a>, a TC39 member, kindly enough clarified <a href="https://twitter.com/#!/littlecalculist/status/191549755413889024">TC39 won't just break working code for no good reason</a>. All the more when there's such a large body of
working code relying on this particular feature all the way around.
</p>
<p>
Brendan Eich also discussed the issue with compatibility with older versions of
ECMAScript and legacy code as they move forward to extend the language, several
times (in his blog, in es-discuss, in twitter, in&hellip;).
</p>
<p>
It can all be summed up as: "if something is working and in use in the
JavaScript community, we can't just break it."
</p>
<p>
So, no, your code will not suddenly break if you start omitting semicolons here
and there. Now, I can't guarantee people won't want to break <b>you</b>.
</p>

</div>
</div>

</div>
