source/_posts/2012-04-16-on-semicolons-and-subjective-discussions-revisited.org
* Reasons to use or not ASI

So, this all said, there are any actual arguments in favour of omitting
semicolons from your code, aside from the "well, duh, we can!" non-argument
argument? Turns out, there are a few, but they're all overtly subjective, and
not in any sense technical:

 - Consistency! I write code in other languages that use no semicolons, so
   avoiding them in JavaScript makes it easier for me to switch back and forth,
   without inserting them in the wrong places, in the wrong languages.

 - Semicolons are not necessary, thus removing them promotes them from ordinary
   statement terminators/separators to special tokens that should be present in
   certain situations. It's expected that this change in the role of semicolons
   would highlight certain kinds of bugs, by making lacks of semicolons in
   places where they matter more apparent.
   
 - Removing semicolons reduces the overall noise of a source code, granted the
   indication given by semicolons is duplicated by line breaks and indentation,
   this means that we don't have extraneous and needless symbols to distract
   you from the actual code.
   

Of course, there are reasons for not relying on ASI, and the valid ones are
also overtly subjective, and not in any sense technical:

 - Consistency! I write code in other languages that use no ASI, so putting
   them everywhere in JavaScript makes it easier for me to switch back and
   forth, without omitting them in the wrong places, in the wrong languages.
   
 - Avoiding semicolons means that you have a higher cognitive load, and you
   must always scan much more of the source code than you should, just to be
   sure that the next line doesn't imply a continuation.

 - I use tools that don't support ASI (like JSMin, or JSLint).
   
   
Okay, the last one of those is not a subjective reason not to rely on ASI, but
is not a technical reason on why *other* people should do the same. After all,
you're just relying on a broken tool.


* Conclusion

You should omit all semicolons from all your JavaScript code. Semicolons
everywhere are *insanely stupid code*, and I'm not going to change my coding
style because some punks dislike it... wait, that wasn't really the topic in
discussion. Well, whatever.




